project-chip/connectedhomeip/examples/platform/stm32/common/STM32WBA65I-DK1/Common/WPAN/Modules/adc_ctrl.c
/**
  ******************************************************************************
  * @file    adc_ctrl.c
  * @author  MCD Application Team
  * @brief   Source file for ADC controller module
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

/* Utilities */
#include "utilities_common.h"

/* Real time trace for debug */
#include "RTDebug.h"

/* Own header files */
#include "adc_ctrl.h"
#include "adc_ctrl_conf.h"

/* LL ADC header */
#include "stm32wbaxx_ll_adc.h"

/* Private defines -----------------------------------------------------------*/
/**
 * @brief Initial value define for configuration tracking number
 */
#define ADCCTRL_NO_CONFIG   (uint32_t)(0x00000000u)

/**
 * @brief Init variable out of expected ADC conversion data range
 */
#define VAR_CONVERTED_DATA_INIT_VALUE_12B  (__LL_ADC_DIGITAL_SCALE(LL_ADC_RESOLUTION_12B) + 1)
#define VAR_CONVERTED_DATA_INIT_VALUE_10B  (__LL_ADC_DIGITAL_SCALE(LL_ADC_RESOLUTION_10B) + 1)
#define VAR_CONVERTED_DATA_INIT_VALUE_8B  (__LL_ADC_DIGITAL_SCALE(LL_ADC_RESOLUTION_8B) + 1)
#define VAR_CONVERTED_DATA_INIT_VALUE_6B  (__LL_ADC_DIGITAL_SCALE(LL_ADC_RESOLUTION_6B) + 1)

/**
 * @brief Internal temperature sensor, parameter V30 (unit: mV).
 *
 * @details Refer to device datasheet for min/typ/max values.
 *
 */
#define TEMPSENSOR_TYP_CAL1_V          (( int32_t)  760)

/**
 * @brief Internal temperature sensor, parameter Avg_Slope (unit: uV/DegCelsius).
 *
 * @details Refer to device datasheet for min/typ/max values.
 *
 */
#define TEMPSENSOR_TYP_AVGSLOPE        (( int32_t) 2500)

/* Definitions of environment analog values */
/**
 * @brief Value of analog reference voltage (Vref+), connected to analog voltage
 *
 * @details supply Vdda (unit: mV).
 *
 */
#ifndef VDDA_APPLI
#define VDDA_APPLI      VDD_VALUE
#endif

/* Private typedef -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/**
 * @brief  ADC IP Client list
 */
static uint32_t ClientList;

/**
 * @brief Tracker of the current applied configuration
 */
static uint32_t CurrentConfig = ADCCTRL_NO_CONFIG;

/**
 * @brief Higher registered handle ID
 */
static uint32_t MaxRegisteredId = ADCCTRL_NO_CONFIG;

/**
 * @brief Handle of the ADC
 */
static ADC_TypeDef * p_ADCHandle = ADCCTRL_HWADDR;

#if (ADCCTRL_USE_DYNAMIC_VREF == 1u)
/**
 * @brief ADC Handle configuration for LL VRefInt request
 */
 static ADCCTRL_Handle_t VRefIntRequest_Handle =
 {
   .Uid = 0x00,
   .State = ADCCTRL_HANDLE_NOT_REG,
   .InitConf =
   {
     .ConvParams =
     {
       .TriggerFrequencyMode = LL_ADC_TRIGGER_FREQ_LOW,
       .Resolution = LL_ADC_RESOLUTION_12B,
       .DataAlign = LL_ADC_DATA_ALIGN_RIGHT,
       .TriggerStart = LL_ADC_REG_TRIG_SOFTWARE,
       .TriggerEdge = LL_ADC_REG_TRIG_EXT_RISING,
       .ConversionMode = LL_ADC_REG_CONV_SINGLE,
       .DmaTransfer = LL_ADC_REG_DMA_TRANSFER_NONE,
       .Overrun = LL_ADC_REG_OVR_DATA_OVERWRITTEN,
       .SamplingTimeCommon1 = LL_ADC_SAMPLINGTIME_814CYCLES_5,
       .SamplingTimeCommon2 = LL_ADC_SAMPLINGTIME_1CYCLE_5
     },
     .SeqParams =
     {
       .Setup = LL_ADC_REG_SEQ_CONFIGURABLE,
       .Length = LL_ADC_REG_SEQ_SCAN_DISABLE,
       .DiscMode = LL_ADC_REG_SEQ_DISCONT_DISABLE
     },
     .LowPowerParams =
     {
       .AutoPowerOff = DISABLE,
       .AutonomousDPD = LL_ADC_LP_AUTONOMOUS_DPD_DISABLE
     }
   },
   .ChannelConf =
   {
     .Channel = LL_ADC_CHANNEL_VREFINT,      /* Internal reference voltage channel */
     .Rank = LL_ADC_REG_RANK_1,
     .SamplingTime = LL_ADC_SAMPLINGTIME_COMMON_1
   }
 };
#endif /* (ADCCTRL_USE_DYNAMIC_VREF == 1u) */

/* Global variables ----------------------------------------------------------*/
/* Error Handler */
extern void Error_Handler(void);

/* Private function prototypes -----------------------------------------------*/
/**
  * @brief  Activate ADC.
  *         Activation order is as follow:
  *         - Enable ADC peripharal clock
  *         - Enable ADC internal voltage regulator
  *         - Enable ADC
  * @param  None
  * @retval None
  */
static inline void AdcActivate (void);

/**
  * @brief  Deactivate ADC IP.
  *         Deactivation order is as follow:
  *         - Disable ADC
  *         - Disable ADC internal voltage regulator
  *         - Disable ADC peripharal clock
  * @param  None
  * @retval None
  */
static inline void AdcDeactivate (void);

/**
  * @brief  Configure ADC IP.
  * @param  p_Handle: Handle to work with
  * @retval State of the configuration
  */
static inline ADCCTRL_Cmd_Status_t AdcConfigure (const ADCCTRL_Handle_t * const p_Handle);

/**
 * @brief Read the raw value
 * @param  p_Handle: Handle to work with
 * @return Raw value
 */
static inline uint16_t AdcReadRaw (const ADCCTRL_Handle_t * const p_Handle);

/**
  * @brief  Perform ADC group regular conversion start, poll for conversion
  *         completion.
  *         (ADCCTRL_HWADDR instance: ADC).
  * @note   This function does not perform ADC group regular conversion stop:
  *         intended to be used with ADC in single mode, trigger SW start
  *         (only 1 ADC conversion done at each trigger, no conversion stop
  *         needed).
  *         In case of continuous mode or conversion trigger set to
  *         external trigger, ADC group regular conversion stop must be added.
  * @param  None
  * @retval None
  */
static inline void ConversionStartPoll_ADC_GrpRegular (void);

/* Functions Definition ------------------------------------------------------*/
__WEAK ADCCTRL_Cmd_Status_t ADCCTRL_Init (void)
{
  ADCCTRL_Cmd_Status_t error = ADCCTRL_UNKNOWN;

