project-chip/connectedhomeip/examples/platform/stm32/common/STM32WBA65I-DK1/Common/WPAN/Modules/adc_ctrl.c
  /* Try to take the ADC mutex */
  error = ADCCTRL_MutexTake ();

  if (ADCCTRL_OK == error)
  {
    CurrentConfig = ADCCTRL_NO_CONFIG;

    p_ADCHandle = ADCCTRL_HWADDR;

    /* Reset ADC Client list */
    ClientList = 0x00u;
    
#if (ADCCTRL_USE_DYNAMIC_VREF == 1u)
    /* Setup the VRefInt handle */
    MaxRegisteredId = MaxRegisteredId + 1u;
    VRefIntRequest_Handle.Uid = MaxRegisteredId;
    VRefIntRequest_Handle.State = ADCCTRL_HANDLE_REG;
#endif /* (ADCCTRL_USE_DYNAMIC_VREF == 1u) */

    /* Deactivate the ADC */
    AdcDeactivate();

    /* Release the mutex */
    ADCCTRL_MutexRelease ();
  }

  return error;
}

__WEAK ADCCTRL_Cmd_Status_t ADCCTRL_RegisterHandle (ADCCTRL_Handle_t * const p_Handle)
{
  ADCCTRL_Cmd_Status_t error = ADCCTRL_UNKNOWN;

  if (NULL == p_Handle)
  {
    error = ADCCTRL_ERROR_NULL_POINTER;
  }
  else if (ADCCTRL_HANDLE_REG == p_Handle->State)
  {
    error = ADCCTRL_HANDLE_ALREADY_REGISTERED;
  }
  else
  {
    /* Try to take the ADC mutex */
    error = ADCCTRL_MutexTake ();

    if (ADCCTRL_OK == error)
    {
      /* Update the maximum registered handle */
      MaxRegisteredId = MaxRegisteredId + 1u;
      /* Update the handle UUID */
      p_Handle->Uid = MaxRegisteredId;
      /* Set handle as initialized */
      p_Handle->State = ADCCTRL_HANDLE_REG;

      /* Release the mutex */
      ADCCTRL_MutexRelease ();
    }
  }

  return error;
}

__WEAK ADCCTRL_Cmd_Status_t ADCCTRL_RequestIpState (const ADCCTRL_Handle_t * const p_Handle,
                                                    const ADCCTRL_Ip_State_t State)
{
  ADCCTRL_Cmd_Status_t error = ADCCTRL_UNKNOWN;

  UTILS_ENTER_CRITICAL_SECTION();

  if (ADC_OFF == State)
  {
    ClientList &= (~(1U << p_Handle->Uid));

    error = ADCCTRL_OK;
  }
  else if (ADC_ON == State)
  {
    ClientList |= (1U << p_Handle->Uid);

    error = ADCCTRL_OK;
  }
  else
  {
    error = ADCCTRL_ERROR_STATE;
  }

  if (0x00u == ClientList)
  {
    /* Disable ADC as there is no request anymore */
    AdcDeactivate();
  }
  else
  {
    /* Enable ADC as there at least one request */
    AdcActivate();
  }

  UTILS_EXIT_CRITICAL_SECTION();

  return error;
}

__WEAK ADCCTRL_Cmd_Status_t ADCCTRL_RequestRawValue (const ADCCTRL_Handle_t * const p_Handle,
                                                     uint16_t * const p_ReadValue)
{
  ADCCTRL_Cmd_Status_t error = ADCCTRL_UNKNOWN;

  /* Null pointer for handle or payload */
  if ((NULL == p_Handle) || (NULL == p_ReadValue))
  {
    error = ADCCTRL_ERROR_NULL_POINTER;
  }
  /* Handle not init */
  else if (ADCCTRL_HANDLE_NOT_REG == p_Handle->State)
  {
    error = ADCCTRL_HANDLE_NOT_REGISTERED;
  }
  /* Handle not in the range */
  else if ((MaxRegisteredId < p_Handle->Uid) ||
           (ADCCTRL_NO_CONFIG >= p_Handle->Uid))
  {
    error = ADCCTRL_HANDLE_NOT_VALID;
  }
  /* Check ADC state */
  else if (0x00u == (ClientList & (1U << p_Handle->Uid)))
  {
    error = ADCCTRL_ERROR_STATE;
  }
  else
  {
    /* Try to take the ADC mutex */
    error = ADCCTRL_MutexTake ();

    if (ADCCTRL_OK == error)
    {
      /* Is the current config IS NOT the same as the one requested ? */
      if (CurrentConfig != p_Handle->Uid)
      {
        /* Configure the ADC before use */
        error = AdcConfigure (p_Handle);

        /* Enable ADC */
        LL_ADC_Enable(p_ADCHandle);
      }

      if (ADCCTRL_OK == error)
      {
        /* Return the read value */
        *p_ReadValue = AdcReadRaw (p_Handle);
      }
      else
      {
        error = ADCCTRL_ERROR_CONFIG;
      }

      /* Release the mutex */
      ADCCTRL_MutexRelease ();
    }
  }

  return error;
}

__WEAK ADCCTRL_Cmd_Status_t ADCCTRL_RequestTemperature (const ADCCTRL_Handle_t * const p_Handle,
                                                        int16_t * const p_ReadValue)
{
  ADCCTRL_Cmd_Status_t error = ADCCTRL_UNKNOWN;

  /* Variables for ADC conversion data */
  __IO uint16_t uhADCxConvertedData = 0x00;

#if (ADCCTRL_USE_DYNAMIC_VREF == 1u)
  uint16_t vddValue = 0x00;
#endif /* (ADCCTRL_USE_DYNAMIC_VREF == 1u) */

  SYSTEM_DEBUG_SIGNAL_SET(ADC_TEMPERATURE_ACQUISITION);

  /* Null pointer for handle or payload */
  if ((NULL == p_Handle) || (NULL == p_ReadValue))
  {
    error = ADCCTRL_ERROR_NULL_POINTER;
  }
  /* Handle not init */
  else if (ADCCTRL_HANDLE_NOT_REG == p_Handle->State)
  {
    error = ADCCTRL_HANDLE_NOT_REGISTERED;
  }
  /* Handle not in the range */
  else if ((MaxRegisteredId < p_Handle->Uid) ||
           (ADCCTRL_NO_CONFIG >= p_Handle->Uid))
  {
    error = ADCCTRL_HANDLE_NOT_VALID;
  }
  /* Check ADC state */
  else if (0x00u == (ClientList & (1U << p_Handle->Uid)))
  {
    error = ADCCTRL_ERROR_STATE;
  }
  else
  {
    /* Try to take the ADC mutex */
    error = ADCCTRL_MutexTake ();

    if (ADCCTRL_OK == error)
    {
#if (ADCCTRL_USE_DYNAMIC_VREF == 1u)     
      /* Configure the ADC before use */
      error = AdcConfigure (&VRefIntRequest_Handle);

      /* Enable ADC */
      LL_ADC_Enable(p_ADCHandle);

      if (ADCCTRL_OK == error)
      {
        /* Return the read value */
        uhADCxConvertedData = AdcReadRaw (p_Handle);

        /* Computation of ADC conversions raw data to physical values             */
        /* using LL ADC driver helper macro.                                      */
        vddValue = __LL_ADC_CALC_VREFANALOG_VOLTAGE (uhADCxConvertedData,
                                                     VRefIntRequest_Handle.InitConf.ConvParams.Resolution);
      }
      else
      {
        error = ADCCTRL_ERROR_CONFIG;
      }
      
      if (ADCCTRL_OK == error)
      {
        /* Configure the ADC before use - Temperature handle */
        error = AdcConfigure (p_Handle);
        
        /* Enable ADC */
        LL_ADC_Enable(p_ADCHandle);
        
        if (ADCCTRL_NOK == error)
        {
          error = ADCCTRL_ERROR_CONFIG;
        }
      }

      if (ADCCTRL_OK == error)
      {
        /* Return the read value */
        uhADCxConvertedData = AdcReadRaw (p_Handle);

        /* Computation of ADC conversions raw data to physical values             */
        /* using LL ADC driver helper macro.                                      */
        if(*TEMPSENSOR_CAL1_ADDR == *TEMPSENSOR_CAL2_ADDR)
        {
          /* Case of samples not calibrated in production */
          *p_ReadValue = __LL_ADC_CALC_TEMPERATURE_TYP_PARAMS (TEMPSENSOR_TYP_AVGSLOPE,
                                                               TEMPSENSOR_TYP_CAL1_V,
                                                               TEMPSENSOR_CAL1_TEMP,
                                                               vddValue,
                                                               uhADCxConvertedData,
                                                               p_Handle->InitConf.ConvParams.Resolution);
        }
        else
        {
          /* Case of samples calibrated in production */
          *p_ReadValue = __LL_ADC_CALC_TEMPERATURE (vddValue,
                                                    uhADCxConvertedData,
                                                    p_Handle->InitConf.ConvParams.Resolution);
        }
      }
#else
      /* Is the current config IS NOT the same as the one requested ? */
      if (CurrentConfig != p_Handle->Uid)
      {
        /* Configure the ADC before use */
        error = AdcConfigure (p_Handle);

