project-chip/connectedhomeip/examples/platform/stm32/common/STM32WBA65I-DK1/Common/WPAN/Modules/adc_ctrl.c
    /* Restore ADC DMA transfer request after calibration */
    LL_ADC_REG_SetDMATransfer(p_ADCHandle, backup_setting_adc_dma_transfer);

    /* Delay required between ADC end of calibration and ADC enable */
    /* LL_ADC_DELAY_CALIB_ENABLE_ADC_CYCLES --> 2 cycles */
    __asm("mov r0, r0");
    __asm("mov r0, r0");
  }

  /* All OK ? */
  if (ADCCTRL_OK == error)
  {
    /* Update init and configuration parameters with requested values */
    ADC_InitStruct.Resolution = p_Handle->InitConf.ConvParams.Resolution;
    ADC_InitStruct.DataAlignment = p_Handle->InitConf.ConvParams.DataAlign;
    
    ADC_REG_InitStruct.TriggerSource = p_Handle->InitConf.ConvParams.TriggerStart;
    ADC_REG_InitStruct.SequencerLength = p_Handle->InitConf.SeqParams.Length;
    ADC_REG_InitStruct.SequencerDiscont = p_Handle->InitConf.SeqParams.DiscMode;
    ADC_REG_InitStruct.ContinuousMode = p_Handle->InitConf.ConvParams.ConversionMode;
    ADC_REG_InitStruct.DMATransfer = p_Handle->InitConf.ConvParams.DmaTransfer;
    ADC_REG_InitStruct.Overrun = p_Handle->InitConf.ConvParams.Overrun;
    
    /* Configure Regular Channel - Only for internal channels */
    if (LL_ADC_CHANNEL_VREFINT == p_Handle->ChannelConf.Channel)
    {
      LL_ADC_SetCommonPathInternalCh(__LL_ADC_COMMON_INSTANCE(p_ADCHandle),
                                     LL_ADC_PATH_INTERNAL_VREFINT);
    }
    else if (LL_ADC_CHANNEL_TEMPSENSOR == p_Handle->ChannelConf.Channel)
    {
      LL_ADC_SetCommonPathInternalCh(__LL_ADC_COMMON_INSTANCE(p_ADCHandle),
                                     LL_ADC_PATH_INTERNAL_TEMPSENSOR);
    }
    else 
    {
      LL_ADC_SetCommonPathInternalCh(__LL_ADC_COMMON_INSTANCE(p_ADCHandle),
                                     LL_ADC_PATH_INTERNAL_NONE);
    }
    
    /* Set trigger frequency */
    LL_ADC_SetTriggerFrequencyMode(p_ADCHandle, 
                                   p_Handle->InitConf.ConvParams.TriggerFrequencyMode);
    
    /* Apply the requested ADC configuration - Init part */
    if (SUCCESS != LL_ADC_Init(p_ADCHandle, 
                               &ADC_InitStruct))
    {
      error = ADCCTRL_NOK;
    }
    else
    {      
      /* Set Sequencer if configurable */
      LL_ADC_REG_SetSequencerConfigurable(p_ADCHandle, 
                                          p_Handle->InitConf.SeqParams.Setup);
      
      /* Apply the requested ADC configuration - Register init part */
      if (SUCCESS != LL_ADC_REG_Init(p_ADCHandle, 
                                     &ADC_REG_InitStruct))
      {      
        error = ADCCTRL_NOK;
      }
      else 
      {
        /* Set Low power characteristics */
        LL_ADC_SetLPModeAutoPowerOff(p_ADCHandle, 
                                     p_Handle->InitConf.LowPowerParams.AutoPowerOff);
        LL_ADC_SetLPModeAutonomousDPD(p_ADCHandle, 
                                      p_Handle->InitConf.LowPowerParams.AutonomousDPD);

        /* Set Sampling time for channels */
        LL_ADC_SetSamplingTimeCommonChannels(p_ADCHandle, 
                                             LL_ADC_SAMPLINGTIME_COMMON_1, 
                                             p_Handle->InitConf.ConvParams.SamplingTimeCommon1);
        LL_ADC_SetSamplingTimeCommonChannels(p_ADCHandle, 
                                             LL_ADC_SAMPLINGTIME_COMMON_2, 
                                             p_Handle->InitConf.ConvParams.SamplingTimeCommon2);
        
        /* Configure the channel */
        LL_ADC_REG_SetSequencerRanks(p_ADCHandle, 
                                     p_Handle->ChannelConf.Rank, 
                                     p_Handle->ChannelConf.Channel);
        LL_ADC_SetChannelSamplingTime(p_ADCHandle, 
                                      p_Handle->ChannelConf.Channel, 
                                      p_Handle->ChannelConf.SamplingTime);
        
        /* Update the current configuration */
        CurrentConfig = p_Handle->Uid; 
      }
    }
  }

  return error;
}

uint16_t AdcReadRaw (const ADCCTRL_Handle_t * const p_Handle)
{
  /* Variables for ADC conversion data */
  __IO uint16_t uhADCxConvertedData = 0x00;

  /* Perform ADC group regular conversion start, poll for conversion        */
  /* completion.                                                            */
  ConversionStartPoll_ADC_GrpRegular ();

  /* Retrieve ADC conversion data */
  switch (p_Handle->InitConf.ConvParams.Resolution)
  {
    case LL_ADC_RESOLUTION_12B:
    {
      uhADCxConvertedData = VAR_CONVERTED_DATA_INIT_VALUE_12B;

      uhADCxConvertedData = LL_ADC_REG_ReadConversionData12(p_ADCHandle);

      break;
    }
    case LL_ADC_RESOLUTION_10B:
    {
      uhADCxConvertedData = VAR_CONVERTED_DATA_INIT_VALUE_10B;

      uhADCxConvertedData = LL_ADC_REG_ReadConversionData10(p_ADCHandle);

      break;
    }
    case LL_ADC_RESOLUTION_8B:
    {
      uhADCxConvertedData = VAR_CONVERTED_DATA_INIT_VALUE_8B;

      uhADCxConvertedData = LL_ADC_REG_ReadConversionData8(p_ADCHandle);

      break;
    }
    case LL_ADC_RESOLUTION_6B:
    {
      uhADCxConvertedData = VAR_CONVERTED_DATA_INIT_VALUE_6B;

      uhADCxConvertedData = LL_ADC_REG_ReadConversionData6(p_ADCHandle);

      break;
    }
    default:
    {
      /* Do nothing */
      break;
    }
  }

  return uhADCxConvertedData;
}

void ConversionStartPoll_ADC_GrpRegular (void)
{

  /* Start ADC group regular conversion */
  /* Note: Hardware constraint (refer to description of the function          */
  /*       below):                                                            */
  /*       On this STM32 series, setting of this feature is conditioned to    */
  /*       ADC state:                                                         */
  /*       ADC must be enabled without conversion on going on group regular,  */
  /*       without ADC disable command on going.                              */
  /* Note: In this example, all these checks are not necessary but are        */
  /*       implemented anyway to show the best practice usages                */
  /*       corresponding to reference manual procedure.                       */
  /*       Software can be optimized by removing some of these checks, if     */
  /*       they are not relevant considering previous settings and actions    */
  /*       in user application.                                               */
  if ((LL_ADC_IsEnabled(p_ADCHandle) == 1)               &&
      (LL_ADC_IsDisableOngoing(p_ADCHandle) == 0)        &&
      (LL_ADC_REG_IsConversionOngoing(p_ADCHandle) == 0)   )
  {
    LL_ADC_REG_StartConversion(p_ADCHandle);
  }
  else
  {
    /* Error: ADC conversion start could not be performed */
    Error_Handler();
  }

  while (LL_ADC_IsActiveFlag_EOC(p_ADCHandle) == 0);

  /* Clear flag ADC group regular end of unitary conversion */
  /* Note: This action is not needed here, because flag ADC group regular   */
  /*       end of unitary conversion is cleared automatically when          */
  /*       software reads conversion data from ADC data register.           */
  /*       Nevertheless, this action is done anyway to show how to clear    */
  /*       this flag, needed if conversion data is not always read          */
  /*       or if group injected end of unitary conversion is used (for      */
  /*       devices with group injected available).                          */
  LL_ADC_ClearFlag_EOC(p_ADCHandle);
}

/* Weak function Definition --------------------------------------------------*/
__WEAK ADCCTRL_Cmd_Status_t ADCCTRL_MutexTake (void)
{
  return ADCCTRL_OK;
}

__WEAK ADCCTRL_Cmd_Status_t ADCCTRL_MutexRelease (void)
{
  return ADCCTRL_OK;
}
